In [2]:
import pandas as pd

In [10]:
df1 = pd.DataFrame({'NOMBRE':['Jose','Axel'],
                    'CARRERA':['Economia','Arquitectura'],
                    'EDAD':[22,26]}).set_index('NOMBRE')

In [12]:
df2 = pd.DataFrame({'NOMBRE':['Juan','Mark'],
                    'CARRERA':['Informatica','Arquitectura'],
                    'EDAD':[23,27]}).set_index('NOMBRE')

In [18]:
df = pd.concat([df1,df2]) # Tienen que tener el mismo indice de columnas

In [16]:
df

             CARRERA  EDAD
NOMBRE
Jose        Economia    22
Axel    Arquitectura    26
Juan     Informatica    23
Mark    Arquitectura    27

In [32]:
df3 = pd.DataFrame({'AUTOS':['Nissan','Ford','Audi'],
                    'COLOR':['blanco','azul','rojo']}).set_index('AUTOS')

In [30]:
df4 = pd.DataFrame({'AUTOS':['Nissan','Ford','Audi'],
                    'MODELO':[2018,2020,2022]}).set_index('AUTOS')

In [38]:
df5 = pd.concat([df3,df4], axis=1) # axis=0 va por defecto

In [42]:
df5 # axis=1 para poder fusionar las dos tablas que tienen distintas filas

         COLOR  MODELO
AUTOS
Nissan  blanco    2018
Ford      azul    2020
Audi      rojo    2022

In [44]:
df6 = pd.DataFrame({'AUTOS':['Nissan','Ford','Audi'],
                    'MODELO':[2018,2020,2022]})

In [58]:
df7 = pd.DataFrame({'AUTOS':['toyota','Ford','Audi'],
                    'COLOR':['blanco','azul','rojo']})

In [68]:
df8 = pd.merge(df6,df7, on='AUTOS', how='outer') # Mezclamos los dos Dataframes, puedes poner right o left en funcion de si quieres
#tomar como principal el primer(df6) o el segundo(df7)

In [62]:
df8

    AUTOS  MODELO   COLOR
0    Audi  2022.0    rojo
1    Ford  2020.0    azul
2  Nissan  2018.0     NaN
3  toyota     NaN  blanco